**FREE
// TODO: Use the regular QtmhRdStin instead of QtmhRdStin2.
// -------------------------------------------------------------------------------------------------
// Description: Definitions of IBM APIs.
//
// @author James Brian Hill
// @copyright Copyright (c) 2015 - 2025 by James Brian Hill
// @license GNU General Public License version 3
// @link https://www.gnu.org/licenses/gpl-3.0.html
// @link https://www.ibm.com/docs/en/i/7.6.0?topic=api-cgi-apis
// -------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------
//   This program is free software: you can redistribute it and/or modify it under the terms of the
// GNU General Public License as published by the Free Software Foundation, either version 3 of the
// License, or (at your option) any later version.
//
//   This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY;
// without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
// GNU General Public License for more details.
//
//   You should have received a copy of the GNU General Public License along with this program. If
// not, see https://www.gnu.org/licenses/gpl-3.0.html
// -------------------------------------------------------------------------------------------------

/IF DEFINED(APIK)
/EOF
/ENDIF
/DEFINE APIK

// -------------------------------------------------------------------------------------------------
// Bring in copybooks.
//
// TEMPLATESK: template data structures and variables.
// -------------------------------------------------------------------------------------------------
/COPY './templatesk.rpgleinc'

// -------------------------------------------------------------------------------------------------
// Define global constants and templates specific to this copybook.
// -------------------------------------------------------------------------------------------------

// -----------------------------------------------
///
// This is a template for the CKPR0100 format which is used by the QSYCHKPR API.
//
// Note that we have defined the password here as being 256 characters - this can be as large as you
// want it to be up to system limits.
//
// Example usage:
// DCL-DS ckpr0100 LIKEDS(tpl_sdk4i_ckpr0100_ds) INZ(*LIKEDS);
//
// @link https://www.ibm.com/docs/en/i/7.6.0?topic=ssw_ibm_i_76/apis/qsychkpr.html
///
// -----------------------------------------------
DCL-DS tpl_sdk4i_ckpr0100_ds QUALIFIED TEMPLATE;
  offset_to_password LIKE(tpl_sdk4i_binary4) INZ(0);
  length_of_password LIKE(tpl_sdk4i_binary4) INZ(0);
  ccsid_of_password LIKE(tpl_sdk4i_binary4) INZ(0);
  password CHAR(256) INZ(*BLANKS);
END-DS tpl_sdk4i_ckpr0100_ds;

// -----------------------------------------------
///
// This is a template for the ERRC0100 format which is used by various IBM APIs.
//
// bytes_provided is provided as input and is the size of this data structure.
// bytes_available is returned by the called API.
// exception_id is returned by the called API.
// reserved is reserved for IBM use.
// exception_data is returned by the called API.
//
// Example usage:
// DCL-DS error_ds LIKEDS(tpl_sdk4i_errc0100_ds) INZ(*LIKEDS);
//
// @link https://www.ibm.com/docs/en/i/7.6.0?topic=parameter-error-code-format
///
// -----------------------------------------------
DCL-DS tpl_sdk4i_errc0100_ds QUALIFIED TEMPLATE;
  bytes_provided LIKE(tpl_sdk4i_binary4) INZ(%SIZE(tpl_sdk4i_errc0100_ds));
  bytes_available LIKE(tpl_sdk4i_binary4) INZ(0);
  exception_id CHAR(7) INZ(*BLANKS);
  reserved CHAR(1) INZ(*BLANKS);
  exception_data VARCHAR(32767) INZ(''); // 32,767 is the maximum available from the API.
END-DS tpl_sdk4i_errc0100_ds;

// -----------------------------------------------
///
//   This is a template for the RCVM0100 format which is used by IBMs Receive Program Message
// (RcvPgmMsg or QmhRcvPm) API.
//
// @link https://www.ibm.com/docs/en/i/7.6.0?topic=ssw_ibm_i_76/apis/QMHRCVPM.html#HDRRCVM1A
///
// -----------------------------------------------
DCL-DS tpl_sdk4i_rcvm0100_ds QUALIFIED TEMPLATE;
  bytes_returned LIKE(tpl_sdk4i_binary4) INZ(0);
  bytes_available LIKE(tpl_sdk4i_binary4) INZ(0);
  msg_severity LIKE(tpl_sdk4i_binary4) INZ(0);
  msg_id CHAR(7) INZ(*BLANKS);
  msg_type CHAR(2) INZ(*BLANKS);
  msg_key CHAR(4) INZ(*BLANKS);
  reserved CHAR(7) INZ(*BLANKS);
  ccsid_sts LIKE(tpl_sdk4i_binary4) INZ(0);
  ccsid_replacement_data LIKE(tpl_sdk4i_binary4) INZ(0);
  len_returned LIKE(tpl_sdk4i_binary4) INZ(0);
  len_available LIKE(tpl_sdk4i_binary4) INZ(0);
  replacement_data CHAR(256) INZ(*BLANKS);
END-DS tpl_sdk4i_rcvm0100_ds;

// -----------------------------------------------
///
// Define a data structure containing the information needed by _GENUUID.
//
// bytes_provided is provided as input and is the size of this data structure.
// bytes_available is output by _GENUUID.
// version is the version of UUID to be generated. You probably want version 4 (RFC 4122 UUID)
//   which is the default. If you enter a 0 or 1 for the version, you will generate a version 1 DCE
//   UUID. Any value besides 0, 1, and 4 will result in an exception (x3801).
// reserved MUST be set to hexadecimal zeros (NULLs) or you will receive an exception (x3801).
// uuid will contain the generated UUID.
//
// Example usage:
// DCL-DS uuid_ds LIKEDS(tpl_sdk4i_uuid_ds) INZ(*LIKEDS);
//
// More about UUID versions. Note that _GENUUID supports a version = 0 or 1 (which returns a
// version 1 DCE). Version = 4 generates an RFC 4122 UUID.
// @link https://en.wikipedia.org/wiki/Universally_unique_identifier#Versions
// @link https://www.ibm.com/docs/en/i/7.6.0?topic=instructions-generate-universal-unique-identifier-genuuid
///
// -----------------------------------------------
DCL-DS tpl_sdk4i_uuid_ds QUALIFIED TEMPLATE;
  bytes_provided LIKE(tpl_sdk4i_unsigned_binary4) INZ(%SIZE(tpl_sdk4i_uuid_ds));
  bytes_available LIKE(tpl_sdk4i_unsigned_binary4) INZ(0);
  version LIKE(tpl_sdk4i_unsigned_binary1) INZ(4);
  reserved CHAR(7) INZ(*ALLx'00');
  uuid CHAR(16) INZ(*BLANKS);
END-DS tpl_sdk4i_uuid_ds;

// For use with the SYSTOOLS.BASE64ENCODE scalar function. (Now used with QSYS.BASE64_ENCODE)
DCL-S tpl_sdk4i_base64_input VARCHAR(2732) CCSID(*UTF8) TEMPLATE;
DCL-S tpl_sdk4i_base64_result VARCHAR(3643) TEMPLATE;

// For use with the QCMDEXC command.
DCL-S tpl_sdk4i_qcmdexc_cmd CHAR(32702) TEMPLATE;
DCL-S tpl_sdk4i_qcmdexc_igc CHAR(3) TEMPLATE;
DCL-S tpl_sdk4i_qcmdexc_len PACKED(15:5) TEMPLATE;

// -----------------------------------------------
///
// Convert a character string to a hexadecimal string.
//
// The C prototype we are calling can be found in QSYSINC/MIH/cvtch.c
//
// @param REQUIRED: address of hexadecimal string (target).
// @param REQUIRED: address of binary character string (source).
// @param REQUIRED. The length of the hexadecimal string (length of target).
//
// @link https://www.ibm.com/docs/en/i/7.6.0?topic=instructions-convert-character-hex-cvtch
///
// -----------------------------------------------
DCL-PR API_CharToHex EXTPROC('cvtch');
  p_hex POINTER VALUE; // Address of hex string (target).
  p_char POINTER VALUE; // Address of character string (source).
  hex_length LIKE(tpl_sdk4i_binary4) VALUE; // Length of hex string (length of target).
END-PR API_CharToHex;

// -----------------------------------------------
///
// Validate a password against the password rules defined by the system.
//
// @warning REQUIRES IBM i VERSION 7.5 OR HIGHER.
//
// @param REQUIRED The user profile being checked or *NONE or *CURRENT.
// @param REQUIRED A data structure of the format CKPR0100, populated with password related information to be validated.
// @param REQUIRED The string 'CKPR0100'.
// @param REQUIRED The error data structure returned by the API.
//
// @link https://www.ibm.com/docs/en/i/7.6.0?topic=ssw_ibm_i_76/apis/qsychkpr.html#HDRCKPR100
///
// -----------------------------------------------
DCL-PR API_CheckPassword EXTPGM('QSYCHKPR');
  i_usrprf CHAR(10) CONST;
  i_ckpr0100_ds LIKEDS(tpl_sdk4i_ckpr0100_ds) CONST;
  i_format CHAR(8) CONST;
  o_error_ds LIKEDS(tpl_sdk4i_errc0100_ds);
END-PR API_CheckPassword;

// -----------------------------------------------
///
// Copy data from one location in memory to another.
//
// IBM says CPYBWP is preferred for performance reasons.
//
// @param REQUIRED. This is a pointer to where you want to copy the data to.
// @param REQUIRED. This is a pointer to where the data is now.
// @param REQUIRED. This is how long the source data is.
//
// @link https://www.ibm.com/docs/en/i/7.6.0?topic=instructions-memory-copy-memcpy
// @link https://www.ibm.com/docs/en/i/7.6.0?topic=instructions-copy-bytes-pointers-cpybwp
///
// -----------------------------------------------
DCL-PR API_CopyMemory EXTPROC('memcpy');
  i_target POINTER VALUE;
  i_source POINTER VALUE;
  i_length LIKE(tpl_sdk4i_unsigned_binary4) VALUE;
END-PR API_CopyMemory;

// -----------------------------------------------
///
// Copy data with pointers.
//
// Copy data from one location in memory to another using pointers. IBM says CPYBWP is preferred
// over MEMCPY for performance reasons. Note that the target and source locations must be aligned
// on a 16-byte boundary.
//
// @param REQUIRED. This is a pointer to where you want to copy the data to.
// @param REQUIRED. This is a pointer to where the data is now.
// @param REQUIRED. This is how long the source data is.
//
// @link https://www.ibm.com/docs/en/i/7.6.0?topic=instructions-copy-bytes-pointers-cpybwp
// @link https://www.ibm.com/support/pages/node/1118397
// @link https://www.ibm.com/docs/en/i/7.6.0?topic=keywords-alignfull#dalign
///
// -----------------------------------------------
DCL-PR API_CopyWithPointer EXTPROC('_CPYBWP');
  target POINTER VALUE;
  source POINTER VALUE;
  length LIKE(tpl_sdk4i_unsigned_binary4) VALUE;
END-PR API_CopyWithPointer;

// -----------------------------------------------
///
// Define the call to the QtmsCreateSendEmail API.
//
// The only limit to the size of the message sent with this API is whatever is imposed by mail
// servers between you and your recipient(s). This API is not limited to 5,000 characters like other
// APIs and commands.
//
// The C prototype is in QSYSINC/H/QTMSCRTSNM.
//
// Also see procedure COM_SendEmail in /com/qrpglesrc/com.sqlrpgle.
//
// @param REQUIRED. A pointer to an array of tpl_sdk4i_rcpt0100_ds data structures.
// @param REQUIRED. The number of elements in recipient_array - %ELEM(recipient_array).
// @param REQUIRED. The format of the recipient data structures - DCL-S recipient_format CHAR(8) INZ('RCPT0100');
// @param REQUIRED. A pointer to a tpl_sdk4i_note0100_ds data structure.
// @param REQUIRED. The format of the note data structure - DCL-S note_format CHAR(8) INZ('NOTE0100');
// @param OPTIONAL. A pointer to an array of tpl_sdk4i_atch0100_ds data structures.
// @param OPTIONAL. The number of elements in attachment_array - %ELEM(attachment_array).
// @param OPTIONAL. The format of the attachment data structures - DCL-S attachment_format CHAR(8) INZ('ATCH0000'); - or ATCH0100 if there are any attachments.
// @param OPTIONAL. A tpl_sdk4i_errc0100_ds data structure.
//
// @link https://www.ibm.com/docs/en/i/7.6.0?topic=ssw_ibm_i_76/apis/qtmscreatesendemail.html
///
// -----------------------------------------------
DCL-PR API_CreateAndSendEmail EXTPROC('QtmsCreateSendEmail');
  recipient_array POINTER VALUE; // char* = an actual pointer.
  recipient_count LIKE(tpl_sdk4i_unsigned_binary4) VALUE; // unsigned int = UNS(10).
  recipient_format POINTER VALUE; // char* = RPG CHAR(8) variable.
  note POINTER VALUE; // char* = an actual pointer.
  note_format POINTER VALUE; // char* = RPG CHAR(8) variable.
  attachment_array POINTER VALUE OPTIONS(*NOPASS); // char* = an actual pointer.
  attachment_count LIKE(tpl_sdk4i_unsigned_binary4) VALUE OPTIONS(*NOPASS); // unsigned int=UNS(10)
  attachment_format POINTER VALUE OPTIONS(*NOPASS); // char* = RPG CHAR(8) variable.
  error_ds LIKEDS(tpl_sdk4i_errc0100_ds) OPTIONS(*NOPASS); // char* = tpl_errc0100_ds.
END-PR API_CreateAndSendEmail;

// -----------------------------------------------
///
// Display a command line.
//
// Example:
// QUSCMDLN;
//
// @link https://www.ibm.com/docs/en/i/7.6.0?topic=ssw_ibm_i_76/apis/quscmdln.htm
///
// -----------------------------------------------
DCL-PR API_DisplayCmdLine EXTPGM('QUSCMDLN');
END-PR API_DisplayCmdLine;

// -----------------------------------------------
///
// Have the system execute a command.
//
// Example:
// DCL-S cmd LIKE(tpl_sdk4i_api_qcmdexc_cmd);
// DCL-S cmd_len LIKE(tpl_sdk4i_api_qcmdexc_len);
// cmd = 'CLRPFM LIB/FILE';
// MONITOR;
//   API_ExecuteCommand(cmd: %LEN(cmd));
// ON-ERROR;
//   // Log the error and handle it gracefully.
// ENDMON;
//
// @param REQUIRED. The command to be executed.
// @param REQUIRED. The length of the command to be executed.
// @param OPTIONAL. If provided, must be 'IGC'. Tells the system to accept double byte data.
//
// @link https://www.ibm.com/docs/en/i/7.6.0?topic=ssw_ibm_i_76/apis/qcmdexc.htm
///
// -----------------------------------------------
DCL-PR API_ExecuteCommand EXTPGM('QCMDEXC');
  i_command LIKE(tpl_sdk4i_qcmdexc_cmd) CONST; // 32702 is maximum size allowed.
  i_length LIKE(tpl_sdk4i_qcmdexc_len) CONST;
  i_igc LIKE(tpl_sdk4i_qcmdexc_igc) OPTIONS(*NOPASS) CONST;
END-PR API_ExecuteCommand;

// -----------------------------------------------
///
// Generate a Universally Unique IDentifier (UUID).
//
// @param REQUIRED: the address of the uuid_ds data structure.
//
// @link https://www.ibm.com/docs/en/i/7.6.0?topic=instructions-generate-universal-unique-identifier-genuuid
///
// -----------------------------------------------
DCL-PR API_GenerateUUID EXTPROC('_GENUUID');
  p_uuid_ds POINTER VALUE; // Address of uuid_ds
END-PR API_GenerateUUID;

// -----------------------------------------------
///
// Get the value of an environment variable.
//
// This procedure is found in IBM's QPOZCPA service program.
//
// Example:
// DCL-S env_var VARCHAR(50);
// env_var = %STR(GetEnv('REQUEST_METHOD'));
//
// @param REQUIRED. A string containing the name of the environment variable to be retrieved.
//
// @link https://www.ibm.com/docs/en/i/7.6.0?topic=ssw_ibm_i_76/apis/evgetenv.html
///
// -----------------------------------------------
DCL-PR API_GetEnv POINTER EXTPROC('getenv');
  env_var_name POINTER VALUE OPTIONS(*STRING: *TRIM);
END-PR API_GetEnv;

// -----------------------------------------------
///
// Get a profile handle.
//
//   This procedure retrieves a profile handle from the OS. It is also useful for simply validating
// a user profile/password pair.
//
//   SDK4i uses this API to validate a user profile and password pair - and that requires three
// optional parameters to be passed (o_error_ds, i_pwd_len, and i_pwd_ccsid).
//
//   There are more parameters that can be passed, SDK4i doesn't need them though so they are not
// defined. If you need them, you can update this source to fit your needs and do a search of the
// SDK4i source to see if you need to make any other changes. Currently, this API is only used in
// the sec/qrpglesrc/sec.sqlrpgle program, in the SEC_AuthenticateUserProfile procedure.
//
// @param REQUIRED. The user profile.
// @param REQUIRED. The password for the user profile.
// @param REQUIRED. A parameter to hold the profile handle - will be cleared first.
// @param OPTIONAL. The error data structure returned by the API.
// @param OPTIONAL. The length of the password. Can be 1 - 512.
// @param OPTIONAL. The CCSID of the password. See IBM documentation for details.
//
// @link https://www.ibm.com/docs/en/i/7.6.0?topic=ssw_ibm_i_76/apis/QSYGETPH.html
///
// -----------------------------------------------
DCL-PR API_GetProfileHandle EXTPGM('QSYGETPH');
  i_user_profile CHAR(10) CONST;
  i_pwd CHAR(512) CONST;
  o_handle CHAR(12);
  o_error_ds LIKEDS(tpl_sdk4i_errc0100_ds) OPTIONS(*NOPASS);
  i_pwd_len LIKE(tpl_sdk4i_binary4) OPTIONS(*NOPASS) CONST;
  i_pwd_ccsid LIKE(tpl_sdk4i_binary4) OPTIONS(*NOPASS) CONST;
END-PR API_GetProfileHandle;

// -----------------------------------------------
///
// Convert a hexadecimal string to a character string.
//
// The C prototype we are calling can be found in QSYSINC/MIH/cvthc.c
//
// @param REQUIRED. Address of a character string (target).
// @param REQUIRED. Address of a hexadecimal string (source).
// @param REQUIRED: length of binary character string (length of target).
//
// @link https://www.ibm.com/docs/en/i/7.6.0?topic=instructions-convert-hex-character-cvthc
///
// -----------------------------------------------
DCL-PR API_HexToChar EXTPROC('cvthc');
  p_char POINTER VALUE; // Address of character string (target).
  p_hex POINTER VALUE; // Address of hex string (source).
  char_length LIKE(tpl_sdk4i_binary4) VALUE; // Length of the character string (length of target).
END-PR API_HexToChar;

// -----------------------------------------------
///
// Read from the STDIN file descriptor (stream).
//
// This procedure is in the QHTTPSVR/QZHBCGI service program provided by IBM. Note that it only
// reads POST data.
//
// Example: see procedure WEB_GetHTTPRequest in /web/qrpglesrc/web.sqlrpgle.
//
// @param REQUIRED. A pointer which will point to the data.
// @param REQUIRED. The length of the data to be read.
// @param REQUIRED. The length of data actually read.
// @param REQUIRED. An errc0100 data structure used by IBM APIs.
//
// @link https://www.ibm.com/docs/en/i/7.6.0?topic=ssw_ibm_i_76/rzaie/rzaieapi_qtmhrdstin.html
///
// -----------------------------------------------
DCL-PR API_ReadFromStdIn EXTPROC('QtmhRdStin');
  i_data POINTER VALUE;
  i_data_length LIKE(tpl_sdk4i_binary4) CONST;
  o_available_length LIKE(tpl_sdk4i_binary4);
  o_error_ds LIKEDS(tpl_sdk4i_errc0100_ds);
END-PR API_ReadFromStdIn;

// TODO: Use the regular QtmhRdStin above with the POINTER instead of this one with CHAR.
DCL-PR API_ReadFromStdIn2 EXTPROC('QtmhRdStin');
  i_data CHAR(C_SDK4I_SIZE_2MI) CCSID(*UTF8);
  i_data_length LIKE(tpl_sdk4i_binary4) CONST;
  o_available_length LIKE(tpl_sdk4i_binary4) CONST;
  o_error_ds LIKEDS(tpl_sdk4i_errc0100_ds);
END-PR API_ReadFromStdIn2;

// -----------------------------------------------
///
//   Receive Program Message.
//
//   Receive a message from a message queue (such as a joblog) and return information about that
// message.
//
// @link https://www.ibm.com/docs/en/i/7.6.0?topic=ssw_ibm_i_76/apis/QMHRCVPM.html
///
// -----------------------------------------------
DCL-PR API_ReceivePgmMsg EXTPGM('QMHRCVPM');
  receiver_ds LIKEDS(tpl_sdk4i_rcvm0100_ds);
  receiver_ds_length LIKE(tpl_sdk4i_binary4) CONST;
  receiver_format_name CHAR(8) CONST;
  call_stack_entry CHAR(10) CONST;
  call_stack_counter LIKE(tpl_sdk4i_binary4) CONST;
  msg_type CHAR(10) CONST;
  msg_key CHAR(4) CONST;
  wait_time LIKE(tpl_sdk4i_binary4) CONST;
  msg_action CHAR(10) CONST;
  error_ds LIKEDS(tpl_sdk4i_errc0100_ds);
END-PR API_ReceivePgmMsg;

// -----------------------------------------------
///
// Release a profile handle.
//
// @param REQUIRED. The profile handle to be released.
// @param OPTIONAL. The error data structure returned by the API.
//
// @link o_error_ds LIKEDS(tpl_sdk4i_errc0100_ds) OPTIONS(*NOPASS);
///
// -----------------------------------------------
DCL-PR API_ReleaseProfileHandle EXTPGM('QSYRLSPH');
  i_handle CHAR(12) CONST;
  o_error_ds LIKEDS(tpl_sdk4i_errc0100_ds) OPTIONS(*NOPASS);
END-PR API_ReleaseProfileHandle;

// -----------------------------------------------
///
//   Remove Program Messages.
//
//   Remove one or more messages from call message queues (such as a joblog).
//
// @link https://www.ibm.com/docs/en/i/7.6.0?topic=ssw_ibm_i_76/apis/QMHRMVPM.html
///
// -----------------------------------------------
DCL-PR API_RemovePgmMsg EXTPGM('QMHRMVPM');
  call_stack_entry CHAR(10) CONST;
  call_stack_counter LIKE(tpl_sdk4i_binary4) CONST;
  message_key CHAR(4) CONST;
  messages_to_remove CHAR(10) CONST;
  error_ds LIKEDS(tpl_sdk4i_errc0100_ds);
END-PR API_RemovePgmMsg;

// -----------------------------------------------
///
//   Send a break message to a user.
//
// @param REQUIRED. *INFO (no reply necessary) or *INQ (reply required).
// @param REQUIRED. *BREAK (break message) or *NORMAL (goes to message queue).
// @param REQUIRED. The message to be sent.
// @param REQUIRED. The length of the message to be sent.
// @param REQUIRED. An array of user profiles to send the message to.
// @param REQUIRED. The number of user profiles passed.
// @param REQUIRED. 0=none, 1=one or more sent, 2=some not sent because invalid.
// @param REQUIRED. 0=Send a Message display was not used.
// @param REQUIRED. IBM error data structure.
// @param REQUIRED. Y=Use the Send a Message display, N=do not use.
// @param REQUIRED. Message queue to receive the reply for *INQ messages.
// @param REQUIRED. *USR=User profiles, *DSP=display station names.
//
// @link https://www.ibm.com/docs/en/i/7.6.0?topic=ssw_ibm_i_76/apis/QEZSNDMG.html
///
// -----------------------------------------------
DCL-PR API_SendMessage EXTPGM('QEZSNDMG');
  i_message_type CHAR(10) CONST;
  i_delivery_mode CHAR(10) CONST;
  i_message_text CHAR(494) CONST;
  i_message_length LIKE(tpl_sdk4i_binary4) CONST;
  i_usrprf_array CHAR(10) DIM(299) CONST;
  i_usrprf_count LIKE(tpl_sdk4i_binary4) CONST;
  o_message_sent LIKE(tpl_sdk4i_binary4);
  o_function_requested LIKE(tpl_sdk4i_binary4);
  o_error_ds LIKE(tpl_sdk4i_errc0100_ds);
  i_show_display CHAR(1) CONST;
  i_msgq CHAR(20) CONST;
  i_name_type CHAR(4) CONST;
END-PR API_SendMessage;

// -----------------------------------------------
///
// Write to the STDOUT file descriptor (stream).
//
// This procedure is in the QHTTPSVR/QZHBCGI service program provided by IBM.
//
// Example:
// DCL-DS error_ds LIKEDS(tpl_sdk4i_errc0100_ds) INZ(*LIKEDS);
// DCL-S data LIKE(tpl_sdk4i_db_varchar);
// data = 'This is my test string';
// WriteStdout(%ADDR(data: *DATA): %LEN(data): error_ds);
// IF (error_ds.bytes_available > 0);
//   // Log the error and handle gracefully.
// ENDIF;
//
// Also see procedure WEB_WriteStdout in /web/qrpglesrc/web.sqlrpgle.
//
// @param REQUIRED. A pointer to the data to be written.
// @param REQUIRED. The length of data to be written.
// @param REQUIRED. An errc0100 data structure used by IBM APIs.
//
// @link https://www.ibm.com/docs/en/i/7.6.0?topic=ssw_ibm_i_76/rzaie/rzaieapi_qtmhwrstout.html
///
// -----------------------------------------------
DCL-PR API_WriteStdOut EXTPROC('QtmhWrStout');
  i_data POINTER VALUE;
  i_data_length LIKE(tpl_sdk4i_binary4) CONST;
  o_error_ds LIKEDS(tpl_sdk4i_errc0100_ds);
END-PR API_WriteStdOut;