**FREE
// -------------------------------------------------------------------------------------------------
// Set SQL options.
//
// DATFMT, DATSEP, DECMPT, TIMFMT, and TIMSEP are set to ISO standards.
//
// DLYPRP and SQLCA are set to optimize performance.
//
// EXTIND is set to provide all possible functionality to the programmer.
//
// @author James Brian Hill
// @copyright Copyright (c) 2015 - 2025 by James Brian Hill
// @license GNU General Public License version 3
// @link https://www.gnu.org/licenses/gpl-3.0.html
// @link https://www.ibm.com/docs/en/i/7.6.0?topic=statements-set-option
// https://www.ibm.com/docs/en/i/7.6.0?topic=sql-indicator-variables-used-assign-special-values
// -------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------
//   This program is free software: you can redistribute it and/or modify it under the terms of the
// GNU General Public License as published by the Free Software Foundation, either version 3 of the
// License, or (at your option) any later version.
//
//   This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY;
// without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
// GNU General Public License for more details.
//
//   You should have received a copy of the GNU General Public License along with this program. If
// not, see https://www.gnu.org/licenses/gpl-3.0.html
// -------------------------------------------------------------------------------------------------

/IF DEFINED(SQLOPTK)
/EOF
/ENDIF
/DEFINE SQLOPTK

// -------------------------------------------------------------------------------------------------
EXEC SQL SET OPTION DATFMT=*ISO, DATSEP=*DASH, DECMPT=*PERIOD, DLYPRP=*YES, EXTIND=*YES, SQLCA=*NO,
  TIMFMT=*ISO, TIMSEP=*COLON;
// -------------------------------------------------------------------------------------------------
